#encoding:utf-8
#!/user/bin/python

'''
前面两行#encoding:utf-8
        #!/user/bin/python
的作用：
第一行：#encoding:utf-8
用于声明当前文件编码，防止程序乱码出现

第二行: #!/user/bin/python
用于声明python文件 

养成良好编码习惯，敲代码时习惯添加这两行注释。
'''

'''
变量：仅仅使用字面意义上的常量很快就会引发烦恼——
我们需要一种既可以储存信息 又可以对它们进行操作的方法。
这是为什么要引入 变量 。
变量就是我们想要的东西——它们的值可以变化，
即你可以使用变量存储任何东西。变量只是你的计算机中存储信息的一部分内存。
与字面意义上的常量不同，你需要一些能够访问这些变量的方法，因此你给变量名字。
'''

#数据类型 int
num1 = 50 #这里的num1就是一个变量名 可以自己更换变量名
num2 = 60 

#去除前面的注释即可 解除封印~~ 查看代码效果
#print('num1 = ',num1)
#print('num2 = ',num2)  
#print(num1+num2) 

#str类型的数据(字符类型)
name = "Jaydenchan"
str1 = "My name is "
#去除前面的注释即可 解除封印~~ 查看代码效果
#print(str1 + name) # 字符串中 可用 + 号作为连接符 可以理解为把两串字符串成一串  



#布尔类型数据
'''
布尔类型数据可以理解为一个开关

True即为 开
False即为 关
详细的用法后面会解答
'''
a = True
b = False

#字典，列表，元组 我们会后面再讲
#现在，我们只介绍一些简单的数据类型


'''自己尝试修改程序,看看有没有什么新发现'''